yjdwbj/msp432_cmake_clang/app/common/mqtt_client_app.c
/*
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*****************************************************************************

   Application Name     -   MQTT Client
   Application Overview -   The device is running a MQTT client which is
                           connected to the online broker. Three LEDs on the
                           device can be controlled from a web client by
                           publishing msg on appropriate topics. Similarly,
                           message can be published on pre-configured topics
                           by pressing the switch buttons on the device.

   Application Details  - Refer to 'MQTT Client' README.html

*****************************************************************************/
//*****************************************************************************
//
//! \addtogroup mqtt_server
//! @{
//
//*****************************************************************************
/* Standard includes                                                         */
#include <mqueue.h>
#include <pthread.h>
#include <semaphore.h>
#include <stdlib.h>
#include <time.h>
#include <unistd.h>

/* TI-Driver includes                                                        */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/I2C.h>
#include <ti/drivers/SPI.h>

/* Simplelink includes                                                       */
#include <ti/drivers/net/wifi/simplelink.h>

/* SlNetSock includes
 * Note: These files are came from simplelink-sdk-wifi-plugin。                                                */
#include <ti/drivers/net/wifi/slnetifwifi.h>
// #include <ti/net/slnetif.h>
// #include <ti/net/slnetsock.h>
// #include <ti/net/slnetutils.h>

// ndk socket
#include <ti/ndk/inc/netmain.h>
#include <ti/ndk/inc/socketndk.h>
#include <ti/ndk/inc/stkmain.h>

/* MQTT Library includes                                                     */
#include <ti/net/mqtt/mqttclient.h>

/* Common interface includes                                                 */
#include "network_if.h"
#include "uart_term.h"

/* Application includes                                                      */
#include "Board.h"
#include "client_cbs.h"
// #include <ti/drivers/gpio/GPIOMSP432E4.h>

#include "ti/devices/msp432e4/inc/msp432e401y.h"

#define DATA_HMC5883L_CHAR2 0x02
#define DATA_DHT11_CHAR3 0x03
#define DATA_BMP180_CHAR4 0x04

#define PROFILE_VALUE 0x00
#define PROFILE_ID_CREATE(C, H) ((C << 2) | H)
#define DS_HMC5883L_ID PROFILE_ID_CREATE(DATA_HMC5883L_CHAR2, PROFILE_VALUE)
#define DS_DHT11_ID PROFILE_ID_CREATE(DATA_DHT11_CHAR3, PROFILE_VALUE)
#define DS_BMP180_ID PROFILE_ID_CREATE(DATA_BMP180_CHAR4, PROFILE_VALUE)

uint8_t DataService_setParameter(uint8_t param, uint16_t len, void *value);

/* This function is to enable it to support IPv6. */
extern MQTT_DeviceNetServices_t MQTTClient_net;

#define IPv6_DEVICE_INDEX 1

//*****************************************************************************
//                          LOCAL DEFINES
//*****************************************************************************
/* enables secured client                                                    */
// #define SECURE_CLIENT
/*  Reference https://e2e.ti.com/support/wireless-connectivity/wifi/f/968/t/862067?tisearch=e2e-sitesearch&keymatch=mbedtls%252525252520ssl%252525252520client */

/* enables client authentication by the server                               */
#define CLNT_USR_PWD

#define CLIENT_INIT_STATE (0x01)
#define MQTT_INIT_STATE (0x04)

#define APPLICATION_VERSION "1.1.1"
#define APPLICATION_NAME "MQTT client"

#define SLNET_IF_WIFI_PRIO (5)

/* Operate Lib in MQTT 3.1 mode.                                             */
#define MQTT_3_1_1 false
#define MQTT_3_1 true

#undef SECURE_CLIENT

#define WILL_TOPIC "Client"
#define WILL_MSG "Client Stopped"
#define WILL_QOS MQTT_QOS_0
#define WILL_RETAIN true

#define STR(x) #x
#define STRINGIFY(x) STR(x)

/* Defining Broker IP address and port Number                                */
// #define SERVER_ADDRESS           "messagesight.demos.ibm.com"
// #define SERVER_ADDRESS           "m2m.eclipse.org"
// #define SERVER_ADDRESS           "test.mosquitto.org"
// #define  SERVER_ADDRESS          "broker.hivemq.com"
// #define SERVER_ADDRESS             "192.168.1.10"
#define SERVER_ADDRESS              STRINGIFY(_MQTT_SRV_IP)
// #define SERVER_ADDRESS             "fe80::ea4e:6ff:fe5b:fa98"
// #define SERVER_IP_ADDRESS        "192.168.178.67"
// #define SERVER_IP_ADDRESS           STRINGIFY(_MQTT_SRV_IP)
#define PORT_NUMBER 1883
#define SECURED_PORT_NUMBER 8883
#define LOOPBACK_PORT 1882

/* Clean session flag                                                        */
#define CLEAN_SESSION true

/* Retain Flag. Used in publish message.                                     */
#define RETAIN_ENABLE 0

/* Defining Number of subscription topics                                    */
#define SUBSCRIPTION_TOPIC_COUNT 4

