yjdwbj/msp432_cmake_clang/app/common/mqtt_client_app.c
/* Defining Subscription Topic Values                                        */
#define SUBSCRIPTION_TOPIC0 "/lcy/To/cc3120"
#define SUBSCRIPTION_TOPIC1 "/lcy/cc3120/LED1"
#define SUBSCRIPTION_TOPIC2 "/lcy/cc3120/LED2"
#define SUBSCRIPTION_TOPIC3 "/lcy/cc3120/report"

/* Defining Publish Topic Values                                             */
#define PUBLISH_TOPIC0 "/lcy/cc3120/sw2"
#define PUBLISH_DHT11 "/lcy/cc3120/dht11"
#define PUBLISH_HMC5883L "/lcy/cc3120/hmc5883l"
#define PUBLISH_BMP180 "/lcy/cc3120/bmp180"
#define PUBLISH_SR501 "/lcy/cc3120/sr501"
#define PUBLISH_SYSINFO "/lcy/cc3120/sys"
#define PUBLISH_BLE_STR "/lcy/cc3120/ble_str"
#define PUBLISH_BLE_RGB "/lcy/cc3120/ble_rgb"

/* Spawn task priority and Task and Thread Stack Size                        */
#define TASKSTACKSIZE 2048
#define RXTASKSIZE 4096
#define MQTTTHREADSIZE 2048
#define SUBTHREADSIZE 2048
#define SMALLTHREADSIZE 1024
#define SPAWN_TASK_PRIORITY 9

/* secured client requires time configuration, in order to verify server     */
/* certificate validity (date).                                              */

/* Day of month (DD format) range 1-31                                       */
#define DAY 1
/* Month (MM format) in the range of 1-12                                    */
#define MONTH 5
/* Year (YYYY format)                                                        */
#define YEAR 2017
/* Hours in the range of 0-23                                                */
#define HOUR 12
/* Minutes in the range of 0-59                                              */
#define MINUTES 33
/* Seconds in the range of 0-59                                              */
#define SEC 21

/* Number of files used for secure connection                                */
#define CLIENT_NUM_SECURE_FILES 1

/* Expiration value for the timer that is being used to toggle the Led.      */
#define TIMER_EXPIRATION_VALUE 100 * 1000000

//*****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//*****************************************************************************
void pushButtonInterruptHandler2(uint_least8_t index);
// void HCSR501_InterruptHandler2(uint_least8_t index);
void pushButtonInterruptHandler3(uint_least8_t index);
void TimerPeriodicIntHandler(sigval val);
void LedTimerConfigNStart();
void LedTimerDeinitStop();
static void DisplayBanner(char *AppName);
void *MqttClient(void *pvParameters);
void Mqtt_ClientStop(uint8_t disconnect);
void Mqtt_ServerStop();
void Mqtt_Stop();
void Mqtt_start();
int32_t Mqtt_IF_Connect();
int32_t MqttServer_start();
int32_t MqttClient_start();
int32_t MQTT_SendMsgToQueue(struct msgQueue *queueElement);

//*****************************************************************************
//                 GLOBAL VARIABLES
//*****************************************************************************

/* Connection state: (0) - connected, (negative) - disconnected              */
int32_t gApConnectionState = -1;
uint32_t gInitState = 0;
uint32_t memPtrCounterfree = 0;
bool gResetApplication = false;
static MQTTClient_Handle gMqttClient;
MQTTClient_Params MqttClientExmple_params;
unsigned short g_usTimerInts;

/* Receive task handle                                                       */
pthread_t g_rx_task_hndl = (pthread_t)NULL;
uint32_t gUiConnFlag = 0;

/* AP Security Parameters                                                    */
SlWlanSecParams_t SecurityParams = {0};

/* Client ID                                                                 */
/* If ClientId isn't set, the MAC address of the device will be copied into  */
/* the ClientID parameter.                                                   */
char ClientId[13] = {'\0'};

/* Client User Name and Password                                             */
const char *ClientUsername = STRINGIFY(_MQTT_USER);
const char *ClientPassword = STRINGIFY(_MQTT_PWD);

/* Subscription topics and qos values                                        */
char *topic[SUBSCRIPTION_TOPIC_COUNT] =
    {SUBSCRIPTION_TOPIC0, SUBSCRIPTION_TOPIC1,
     SUBSCRIPTION_TOPIC2, SUBSCRIPTION_TOPIC3};

unsigned char qos[SUBSCRIPTION_TOPIC_COUNT] =
    {MQTT_QOS_0, MQTT_QOS_0, MQTT_QOS_0, MQTT_QOS_0};

/* Publishing topics and messages                                            */
const char *publish_topic = {PUBLISH_TOPIC0};
const char *publish_dht11_topic = {PUBLISH_DHT11};
const char *publish_SR501_topic = {PUBLISH_SR501};
const char *publish_hmc5883l_topic = {PUBLISH_HMC5883L};
const char *publish_ble_str_topic = {PUBLISH_BLE_STR};
const char *publish_ble_rgb_topic = {PUBLISH_BLE_RGB};
const char *publish_bmp180_topic = {PUBLISH_BMP180};

/* Message Queue                                                             */
mqd_t g_PBQueue;

pthread_t mqttThread = (pthread_t)NULL;
pthread_t appThread = (pthread_t)NULL;

#define SLNETUTIL_ADDRINFO_MAX_DNS_NODES 10
#define SLNETUTIL_DNSBUFSIZE ((SLNETUTIL_ADDRINFO_MAX_DNS_NODES) * \
                              (sizeof(uint32_t)))
#define LL_PREFIX 0xFE80

timer_t g_timer;

/* Printing new line                                                         */
char lineBreak[] = "\r\n";

/* This function is to obtain your own public network IP address. */
extern const void *httpsTask(void *arg0);
static SlNetSock_InAddr_t addr;

pthread_t hmcThread = (pthread_t)NULL;

volatile bool hmcQueueFull = false;
volatile int hmcCount = 0;

//*****************************************************************************
//                 Banner VARIABLES
//*****************************************************************************
#ifdef SECURE_CLIENT

char *Mqtt_Client_secure_files[CLIENT_NUM_SECURE_FILES] = {"ca-cert.pem"};

/*Initialization structure to be used with sl_ExtMqtt_Init API. In order to  */
/*use secured socket method, the flag MQTTCLIENT_NETCONN_SEC, cipher,        */
/*n_files and secure_files must be configured.                               */
/*certificates also must be programmed  ("ca-cert.pem").                     */
/*The first parameter is a bit mask which configures server address type and */
/*security mode.                                                             */
/*Server address type: IPv4, IPv6 and URL must be declared with The          */
/*corresponding flag.                                                        */
/*Security mode: The flag MQTTCLIENT_NETCONN_SEC enables the security (TLS)  */
/*which includes domain name verification and certificate catalog            */
/*verification, those verifications can be disabled by adding to the bit mask*/
/*MQTTCLIENT_NETCONN_SKIP_DOMAIN_NAME_VERIFICATION and                       */
/*MQTTCLIENT_NETCONN_SKIP_CERTIFICATE_CATALOG_VERIFICATION flags             */
/*Example: MQTTCLIENT_NETCONN_IP6 | MQTTCLIENT_NETCONN_SEC |                 */
/*MQTTCLIENT_NETCONN_SKIP_CERTIFICATE_CATALOG_VERIFICATION                   */
/*For this bit mask, the IPv6 address type will be in use, the security      */
/*feature will be enable and the certificate catalog verification will be    */
/*skipped.                                                                   */
/*Note: The domain name verification requires URL Server address type        */
/*      otherwise, this verification will be disabled.                       */
MQTTClient_ConnParams Mqtt_ClientCtx =
    {
        MQTTCLIENT_NETCONN_IP6,
        SERVER_ADDRESS,
        PORT_NUMBER, //  PORT_NUMBER
        SLNETSOCK_SEC_METHOD_SSLv3_TLSV1_2,
        SLNETSOCK_SEC_CIPHER_FULL_LIST,
        CLIENT_NUM_SECURE_FILES,
        Mqtt_Client_secure_files};

void setTime() {
    SlDateTime_t dateTime = {0};
    dateTime.tm_day = (uint32_t)DAY;
    dateTime.tm_mon = (uint32_t)MONTH;
    dateTime.tm_year = (uint32_t)YEAR;
    dateTime.tm_hour = (uint32_t)HOUR;
    dateTime.tm_min = (uint32_t)MINUTES;
    dateTime.tm_sec = (uint32_t)SEC;
    sl_DeviceSet(SL_DEVICE_GENERAL, SL_DEVICE_GENERAL_DATE_TIME,
                 sizeof(SlDateTime_t), (uint8_t *)(&dateTime));
}

#else
MQTTClient_ConnParams Mqtt_ClientCtx =
    {

