yjdwbj/msp432_cmake_clang/app/common/mqtt_client_app.c
#ifdef _USE_IPV6
        MQTTCLIENT_NETCONN_IP6,
#else
        MQTTCLIENT_NETCONN_URL,
#endif
        SERVER_ADDRESS,
        PORT_NUMBER, 0, 0, 0,
        NULL};
#endif

/* Initialize the will_param structure to the default will parameters        */
MQTTClient_Will will_param =
    {
        WILL_TOPIC,
        WILL_MSG,
        WILL_QOS,
        WILL_RETAIN};

//*****************************************************************************
//
//! MQTT_SendMsgToQueue - Utility function that receive msgQueue parameter and
//! tries to push it the queue with minimal time for timeout of 0.
//! If the queue isn't full the parameter will be stored and the function
//! will return 0.
//! If the queue is full and the timeout expired (because the timeout parameter
//! is 0 it will expire immediately), the parameter is thrown away and the
//! function will return -1 as an error for full queue.
//!
//! \param[in] struct msgQueue *queueElement
//!
//! \return 0 on success, -1 on error
//
//*****************************************************************************
int32_t MQTT_SendMsgToQueue(struct msgQueue *queueElement) {
    struct timespec abstime = {0};

    clock_gettime(CLOCK_REALTIME, &abstime);

    if (g_PBQueue) {
        /* send message to the queue                                        */
        if (mq_timedsend(g_PBQueue, (char *)queueElement,
                         sizeof(struct msgQueue), 0, &abstime) == 0) {
            return (0);
        }
    }
    return (-1);
}

//*****************************************************************************
//
//! Push Button Handler1(GPIOSW2). Press push button1 (GPIOSW2) Whenever user
//! wants to publish a message. Write message into message queue signaling the
//! event publish messages
//!
//! \param none
//!
//! return none
//
//*****************************************************************************
void pushButtonInterruptHandler2(uint_least8_t index) {
    struct msgQueue queueElement;

    /* Disable the SW2 interrupt */
    //    GPIO_disableInt(Board_GPIO_BUTTON0); // SW2

    queueElement.event = PUBLISH_PUSH_BUTTON_PRESSED;
    queueElement.msgPtr = NULL;

    /* write message indicating publish message                             */
    if (MQTT_SendMsgToQueue(&queueElement)) {
        UART_PRINT("\r\nQueue is full\\r\n");
    }
}

//*****************************************************************************
//
//! Push Button Handler2(GPIOSW3). Press push button3 Whenever user wants to
//! disconnect from the remote broker. Write message into message queue
//! indicating disconnect from broker.
//!
//! \param none
//!
//! return none
//
//*****************************************************************************
void pushButtonInterruptHandler3(uint_least8_t index) {
    struct msgQueue queueElement;
    struct msgQueue queueElemRecv;

    queueElement.event = DISC_PUSH_BUTTON_PRESSED;
    queueElement.msgPtr = NULL;

    /* write message indicating disconnect push button pressed message      */
    if (MQTT_SendMsgToQueue(&queueElement)) {
        UART_PRINT(
            "Queue is full, throw first msg and send the new one\\r\n");
        mq_receive(g_PBQueue, (char *)&queueElemRecv, sizeof(struct msgQueue),
                   NULL);
        MQTT_SendMsgToQueue(&queueElement);
    }
}

//*****************************************************************************
//
//! Periodic Timer Interrupt Handler
//!
//! \param None
//!
//! \return None
//
//*****************************************************************************
void TimerPeriodicIntHandler(sigval val) {
    /* Increment our interrupt counter.                                      */
    g_usTimerInts++;

    if (!(g_usTimerInts & 0x1)) {
        /* Turn Led Off                                                      */
        GPIO_write(Board_GPIO_LED0, Board_GPIO_LED_OFF);
    } else {
        /* Turn Led On                                                       */
        GPIO_write(Board_GPIO_LED0, Board_GPIO_LED_ON);
    }
}

//*****************************************************************************
//
//! Function to configure and start timer to blink the LED while device is
//! trying to connect to an AP
//!
//! \param none
//!
//! return none
//
//*****************************************************************************
void LedTimerConfigNStart() {
    struct itimerspec value;
    sigevent sev;

    /* Create Timer                                                          */
    sev.sigev_notify = SIGEV_SIGNAL;
    sev.sigev_notify_function = &TimerPeriodicIntHandler;
    timer_create(2, &sev, &g_timer);

    /* start timer                                                           */
    value.it_interval.tv_sec = 0;
    value.it_interval.tv_nsec = TIMER_EXPIRATION_VALUE;
    value.it_value.tv_sec = 0;
    value.it_value.tv_nsec = TIMER_EXPIRATION_VALUE;

    timer_settime(g_timer, 0, &value, NULL);
}

//*****************************************************************************
//
//! Disable the LED blinking Timer as Device is connected to AP
//!
//! \param none
//!
//! return none
//
//*****************************************************************************
void LedTimerDeinitStop() {
    /* Disable the LED blinking Timer as Device is connected to AP.          */
    timer_delete(g_timer);
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void DisplayBanner(char *AppName) {
    UART_PRINT("\r\n");
    UART_PRINT("\t\t *************************************************\r\n");
    UART_PRINT("\t\t    CC32xx %s Application       \r\n", AppName);
    UART_PRINT("\t\t *************************************************\r\n");
    UART_PRINT("\r\n");
}

void *MqttClientThread(void *pvParameters) {
    struct msgQueue queueElement;
    struct msgQueue queueElemRecv;

    MQTTClient_run((MQTTClient_Handle)pvParameters);

