yjdwbj/msp432_cmake_clang/app/common/mqtt_client_app.c
    queueElement.event = LOCAL_CLIENT_DISCONNECTION;
    queueElement.msgPtr = NULL;

    /*write message indicating disconnect Broker message.                   */
    if (MQTT_SendMsgToQueue(&queueElement)) {
        UART_PRINT(
            "Queue is full, throw first msg and send the new one\\r\n");
        mq_receive(g_PBQueue, (char *)&queueElemRecv, sizeof(struct msgQueue),
                   NULL);
        MQTT_SendMsgToQueue(&queueElement);
    }

    pthread_exit(0);

    return (NULL);
}

static void vTaskFunction(void *pvParameters) {
    uint8_t temp = 0;
    uint8_t humi = 0;
    struct msgQueue queueElemRecv;
    uint8_t btdata[2] = {0, 0};

    uint16_t data = 0;
    uint16_t oldtemp = 0;
    sleep(2);
    UART_PRINT("MQTT Client dht11 initialization Task\r\n");

    struct msgQueue queueElement;
    queueElement.event = PUBLISH_EVT_DHT11_DATA;
    queueElement.msgPtr = NULL;
    queueElement.msgPtr = &data;

    while (gResetApplication == false) {

        data = 0;
        temp = 0;
        humi = 0;
        if (!DHT11_Read_Data(&temp, &humi)) {
            data = temp << 8 | humi;
            if (oldtemp != data) {
                btdata[0] = temp;
                btdata[1] = humi;
                DataService_setParameter(DS_DHT11_ID, sizeof(btdata), btdata);
                if (MQTT_SendMsgToQueue(&queueElement)) {
                    UART_PRINT("DHT11 Queue is full\\r\n");
                    mq_receive(g_PBQueue, (char *)&queueElemRecv, sizeof(struct msgQueue),
                               NULL);
                    usleep(50000); // 50ms
                    MQTT_SendMsgToQueue(&queueElement);
                }
            }
            oldtemp = data;
            UART_PRINT("DHT11 update new data \r\n");
        }
        sleep(3);
    }
    UART_PRINT("dht11 Thread Exit!!!!\r\n");
    pthread_exit(0);
}

/*
 * The POSIX multithreading reference here is a sample project in the SimpleLink MCU SDK User's Guide.
 * at <SDK_INSTALL_DIR>\examples\rtos\<board>\demos\portable directory.
 */

static void postSem(union sigval val) {
    sem_t *sem = (sem_t *)(val.sival_ptr);
    sem_post(sem);
}

/*
 *  ======== setupTimer ========
 *  Create a timer that will expire at the period specified by the
 *  time arguments. When the timer expires, the passed in semaphore
 *  will be posted by the postSem function.
 *
 *  A non-zero return indicates a failure.
 */
static int setupTimer(sem_t *sem, timer_t *timerid, time_t sec, long nsec) {
    struct sigevent sev;
    struct itimerspec its;
    int retc;
    //  initially unlocked
    retc = sem_init(sem, 0, 0);
    if (retc != 0) {
        return (retc);
    }

    /* Create the timer that wakes up the thread that will pend on the sem. */
    sev.sigev_notify = SIGEV_SIGNAL;
    sev.sigev_value.sival_ptr = sem;
    sev.sigev_notify_function = &postSem;
    sev.sigev_notify_attributes = NULL;
    retc = timer_create(CLOCK_MONOTONIC, &sev, timerid);
    if (retc != 0) {
        return (retc);
    }

    /* Set the timer to go off at the specified period */
    its.it_interval.tv_sec = sec;
    its.it_interval.tv_nsec = nsec;
    its.it_value.tv_sec = sec;
    its.it_value.tv_nsec = nsec;
    retc = timer_settime(*timerid, 0, &its, NULL);
    if (retc != 0) {
        timer_delete(*timerid);
        return (retc);
    }

    return (0);
}

void *vTaskBMP180(void *pvParameters) {
    char data[32] = {0};
    double ut = 0.0;
    long up = 0;
    struct msgQueue queueElemRecv;

    UART_PRINT("MQTT Client vTaskBMP180 initialization Task\r\n");
    struct msgQueue queueElement;
    queueElement.event = PUBLISH_EVT_BMP180;

    while (gResetApplication == false) {
        if (hmcCount == 6) {
            BMP180_Init();
            BMP180Convert(&ut, &up);
            memset(data, 0, sizeof(data));

            sprintf((char *)&data[0], "%.2f,", ut);
            sprintf((char *)((char *)&data[0] + strlen(data)), "%ld", up);
            queueElement.msgPtr = data;
            queueElement.topLen = strlen(data);
            DataService_setParameter(DS_BMP180_ID, strlen(data), data);
            //            UART_PRINT("vTaskBMP180 new DATA %s,len %d\r\n",data,strlen(data));
            if (MQTT_SendMsgToQueue(&queueElement)) {
                UART_PRINT("vTaskBMP180 Queue is full\r\n");
                mq_receive(g_PBQueue, (char *)&queueElemRecv, sizeof(struct msgQueue),
                           NULL);
            }
            hmcCount = 0;
        }
    }
    UART_PRINT("vTaskBMP180 Thread Exit!!!!\r\n");
    pthread_exit(0);
}

void *vTaskHMC5883L(void *pvParameters) {

    /* Reference https://e2e.ti.com/blogs_/b/analogwire/archive/2015/10/15/how-to-simplify-i2c-tree-when-connecting-multiple-slaves-to-an-i2c-master */
    // How to simplify I2C tree when connecting multiple slaves to an I2C master
    uint8_t data[6] = {0};
    uint32_t x, y, z, angle;
    struct msgQueue queueElemRecv;

    UART_PRINT("MQTT Client vTaskHMC5883L initialization Task\r\n");

    struct msgQueue queueElement;
    queueElement.event = PUBLISH_EVT_HMC_DATA;
    queueElement.msgPtr = &data[0];
    queueElement.topLen = 6;

    while (false == gResetApplication) {

        if (hmcCount != 6) {
            read_data(data, 6);
            x = data[0] << 8 | data[1]; // Combine MSB and LSB of X Data output register
            z = data[2] << 8 | data[3]; // Combine MSB and LSB of Z Data output register
            y = data[4] << 8 | data[5]; // Combine MSB and LSB of Y Data output register

            angle = atan2((double)y, (double)x) * (180 / 3.14159265) + 180; // angle in degrees
            DataService_setParameter(DS_HMC5883L_ID, 6, data);
            if (MQTT_SendMsgToQueue(&queueElement)) {
                UART_PRINT("HMC5883L Queue is full\r\n");
                mq_receive(g_PBQueue, (char *)&queueElemRecv, sizeof(struct msgQueue),
                           NULL);
            }
            hmcCount++;
        }

        usleep(400 * 1000);
    }
    UART_PRINT("HMC5883L Thread Exit!!!!\r\n");
    pthread_exit(0);
}

void start_sub_threads() {
    pthread_t thread;
    uint8_t retc = 0;
    pthread_attr_t attrs;
    struct sched_param priParam;

