yjdwbj/msp432_cmake_clang/app/common/mqtt_client_app.c
    /*
     * Initialize the mutex of the I2C bus.
     * https://processors.wiki.ti.com/index.php/I2C_Tips
     * Here is the use of a mutex to obtain the use of the I2C bus.
     * I don't know why when value is set to 0, sem_wait will always freeze.
     */
    UART_PRINT("start_sub_threads >>>  \r\n");
    //    retc = pthread_mutex_init(&I2CMutex, NULL);
    if (retc != 0) {
        UART_PRINT(" pthread_mutex_init is failed\r\n");
        /* pthread_mutex_init() failed */
        while (1) {
        }
    }

    pthread_attr_init(&attrs);

    /* Set priority, detach state, and stack size attributes */
    priParam.sched_priority = 2; /* The higher the number, the higher the priority. */
    retc = pthread_attr_setschedparam(&attrs, &priParam);
    retc |= pthread_attr_setdetachstate(&attrs, PTHREAD_CREATE_DETACHED);
    retc |= pthread_attr_setstacksize(&attrs, SUBTHREADSIZE);
    if (retc != 0) {
        UART_PRINT(" pthread_attr_setstacksize is failed\r\n");
        /* failed to set attributes */
        while (1) {
        }
    }

    retc = pthread_create(&thread, &attrs, vTaskHMC5883L, NULL);
    if (retc != 0) {
        UART_PRINT(" hread_create(&thread, &attrs, vTaskHMC5883L, NULL); is failed\r\n");
        /* pthread_create() failed */
        while (1) {
        }
    }

    priParam.sched_priority = 1;
    retc = pthread_attr_setschedparam(&attrs, &priParam);
    if (retc != 0) {
        /* failed to set priority */
        while (1) {
        }
    }

    retc = pthread_create(&thread, &attrs, vTaskBMP180, NULL);
    if (retc != 0) {
        UART_PRINT("create(&thread, &attrs, vTaskBMP180, NULL); is failed\r\n");
        /* pthread_create() failed */
        while (1) {
        }
    }

    /*
     *  Let's make the temperature thread a higher priority .
     *  Higher number means higher priority in FreeRTOS.
     */
}

//*****************************************************************************
//
//! Task implementing MQTT Server plus client bridge
//!
//! This function
//!    1. Initializes network driver and connects to the default AP
//!    2. Initializes the mqtt client ans server libraries and set up MQTT
//!       with the remote broker.
//!    3. set up the button events and their callbacks(for publishing)
//!    4. handles the callback signals
//!
//! \param  none
//!
//! \return None
//!
//*****************************************************************************
void *MqttClient(void *pvParameters) {
    struct msgQueue queueElemRecv;
    long lRetVal = -1;
    char *tmpBuff;
    uint32_t retc;
    // append 5B timestamp.
    char ipAddr[SLNETSOCK_INET_ADDRSTRLEN + 5];
    uint8_t addrLen = 0;
    char btnMsg[8] = {'S', 'W', '2', ':', 0, 0, 0, 0};
    struct timespec ts;

    memset(ipAddr, 0, SLNETSOCK_INET_ADDRSTRLEN + 5);

    /*Initializing Client and Subscribing to the Broker.                     */
    if (gApConnectionState >= 0) {
        lRetVal = MqttClient_start();
        if (0 > lRetVal) {
            UART_PRINT("MQTT Client lib initialization failed\r\n");
            pthread_exit(0);
            return (NULL);
        }

        start_sub_threads();
    }

    /*handling the signals from various callbacks including the push button  */
    /*prompting the client to publish a msg on PUB_TOPIC OR msg received by  */
    /*the server on enrolled topic(for which the on-board client ha enrolled)*/
    /*from a local client(will be published to the remote broker by the      */
    /*client) OR msg received by the client from the remote broker (need to  */
    /*be sent to the server to see if any local client has subscribed on the */
    /*same topic).                                                           */
    for (;;) {

        /*waiting for signals                                                */
        mq_receive(g_PBQueue, (char *)&queueElemRecv, sizeof(struct msgQueue),
                   NULL);

        switch (queueElemRecv.event) {
        case PUBLISH_PUSH_BUTTON_PRESSED:
            /* get current time (relative to POSIX Epoch) */
            //            timestamp =time(&ts);
            clock_gettime(CLOCK_REALTIME, &ts);

            btnMsg[4] = (ts.tv_sec >> 24) & 0xff;
            btnMsg[5] = (ts.tv_sec >> 16) & 0xff;
            btnMsg[6] = (ts.tv_sec >> 8) & 0xff;
            btnMsg[7] = ts.tv_sec & 0xff;
            /*send publish message                                       */
            lRetVal =
                MQTTClient_publish(gMqttClient, (char *)publish_topic, strlen((char *)publish_topic), (char *)btnMsg,
                                   8, MQTT_QOS_0);
            time(&ts);
            UART_PRINT("Current date time : %s\r\n", ctime(&ts));
            UART_PRINT("Topic: %s\r\n", publish_topic);
            break;
        case PUBLISH_EVT_SR501_INT:

            /*send publish message                                       */
            lRetVal =
                MQTTClient_publish(gMqttClient, (char *)publish_SR501_topic, strlen((char *)publish_SR501_topic),
                                   (char *)queueElemRecv.msgPtr,
                                   1, MQTT_QOS_2 | ((RETAIN_ENABLE) ? MQTT_PUBLISH_RETAIN : 0));

            UART_PRINT("CC3200 Publishes the SR501 message \r\n");
            UART_PRINT("Topic: %s\r\n", publish_SR501_topic);
            UART_PRINT("Data: %c\r\n", *(char *)queueElemRecv.msgPtr);

            break;
        case PUBLISH_EVT_DHT11_DATA:
            lRetVal =
                MQTTClient_publish(gMqttClient, (char *)publish_dht11_topic, strlen((char *)publish_dht11_topic),
                                   (char *)queueElemRecv.msgPtr,
                                   2, MQTT_QOS_0);
            //            UART_PRINT("Data: %d,%d\r\n", temp, humi);
            break;
        case PUBLISH_EVT_HMC_DATA:
            lRetVal =
                MQTTClient_publish(gMqttClient, (char *)publish_hmc5883l_topic, strlen((char *)publish_hmc5883l_topic),
                                   (char *)queueElemRecv.msgPtr,
                                   queueElemRecv.topLen, MQTT_QOS_0);
            break;
        case PUBLISH_EVT_BMP180:
            lRetVal =
                MQTTClient_publish(gMqttClient, (char *)publish_bmp180_topic, strlen((char *)publish_bmp180_topic),
                                   (char *)queueElemRecv.msgPtr,
                                   queueElemRecv.topLen, MQTT_QOS_0);
            break;
        /*msg received by client from remote broker (on a topic      */
        /*subscribed by local client)                                */
        case MSG_RECV_BY_CLIENT:
            tmpBuff = (char *)((char *)queueElemRecv.msgPtr + 12);
            if (strncmp(tmpBuff, SUBSCRIPTION_TOPIC0, queueElemRecv.topLen) == 0) {
                // pushlich to sys
                lRetVal =
                    MQTTClient_publish(gMqttClient, (char *)publish_topic, strlen((char *)publish_topic),
                                       (char *)"Hello",
                                       5, MQTT_QOS_0);

