yjdwbj/msp432_cmake_clang/app/common/mqtt_client_app.c
                UART_PRINT("CC3200 Publishes the following message \r\n");
                UART_PRINT("Topic: %s\r\n", publish_topic);
            } else if (strncmp(tmpBuff, SUBSCRIPTION_TOPIC1, queueElemRecv.topLen) == 0) {
                /* Why is the offset 29? Because it is encapsulated in MqttClientCallback. */
                GPIO_write(Board_LED0, *(char *)((char *)queueElemRecv.msgPtr + 29) == 0x31 ? Board_LED_ON : Board_LED_OFF);
            } else if (strncmp(tmpBuff, SUBSCRIPTION_TOPIC2,
                               queueElemRecv.topLen) == 0) {
                GPIO_write(Board_LED1, *(char *)((char *)queueElemRecv.msgPtr + 29) == 0x31 ? Board_LED_ON : Board_LED_OFF);
            } else if (strncmp(tmpBuff, SUBSCRIPTION_TOPIC3,
                               queueElemRecv.topLen) == 0) {
                /* Send ip address */
                SlNetUtil_inetNtop(SLNETSOCK_AF_INET, (SlNetSock_InAddr_t *)pvParameters, (char *)ipAddr, SLNETSOCK_INET_ADDRSTRLEN);
                clock_gettime(CLOCK_REALTIME, &ts);
                addrLen = strlen((char *)ipAddr);
                ipAddr[addrLen] = ':';
                ipAddr[addrLen + 1] = (ts.tv_sec >> 24) & 0xff;
                ipAddr[addrLen + 2] = (ts.tv_sec >> 16) & 0xff;
                ipAddr[addrLen + 3] = (ts.tv_sec >> 8) & 0xff;
                ipAddr[addrLen + 4] = ts.tv_sec & 0xff;
                lRetVal =
                    MQTTClient_publish(gMqttClient, (char *)PUBLISH_SYSINFO, strlen((char *)PUBLISH_SYSINFO),
                                       (char *)ipAddr, strlen((char *)ipAddr), MQTT_QOS_0);
            }

            free(queueElemRecv.msgPtr);
            break;

        case PUBLISH_EVT_BLE_STR:
            lRetVal =
                MQTTClient_publish(gMqttClient, (char *)publish_ble_str_topic, strlen((char *)publish_ble_str_topic),
                                   (char *)queueElemRecv.msgPtr,
                                   queueElemRecv.topLen, MQTT_QOS_0);
            break;
        case PUBLISH_EVT_BLE_RGB:
            lRetVal =
                MQTTClient_publish(gMqttClient, (char *)publish_ble_rgb_topic, strlen((char *)publish_ble_rgb_topic),
                                   (char *)queueElemRecv.msgPtr,
                                   queueElemRecv.topLen, MQTT_QOS_0);
            break;
        /*On-board client disconnected from remote broker, only      */
        /*local MQTT network will work                               */
        case LOCAL_CLIENT_DISCONNECTION:
            UART_PRINT("On-board Client Disconnected\r\n");
            gUiConnFlag = 0;
            break;

        /*Push button for full restart check                         */
        case DISC_PUSH_BUTTON_PRESSED:
            gResetApplication = true;
            break;

        case THREAD_TERMINATE_REQ:
            gUiConnFlag = 0;
            pthread_exit(0);
            return (NULL);

        default:
            sleep(1);
            break;
        }
    }
    UART_PRINT("MqttClient exit!!!!!!!!\r\n");
    pthread_exit(0);
    return (NULL);
}

//*****************************************************************************
//
//! This function connect the MQTT device to an AP with the SSID which was
//! configured in SSID_NAME definition which can be found in Network_if.h file,
//! if the device can't connect to to this AP a request from the user for other
//! SSID will appear.
//!
//! \param  none
//!
//! \return None
//!
//*****************************************************************************
int32_t Mqtt_IF_Connect() {
    int32_t lRetVal, retc;
    char SSID_Remote_Name[32];
    int8_t Str_Length;

    pthread_t http_thread = (pthread_t)NULL;
    pthread_attr_t pAttrs_http;
    struct sched_param httpParam;

    memset(SSID_Remote_Name, '\0', sizeof(SSID_Remote_Name));
    Str_Length = strlen(SSID_NAME);

    if (Str_Length) {
        /*Copy the Default SSID to the local variable                        */
        strncpy(SSID_Remote_Name, SSID_NAME, Str_Length);
    }

    /*Display Application Banner                                             */
    DisplayBanner(APPLICATION_NAME);

    GPIO_write(Board_GPIO_LED0, Board_GPIO_LED_OFF);
    GPIO_write(Board_GPIO_LED1, Board_GPIO_LED_OFF);

    /*Reset The state of the machine                                         */
    Network_IF_ResetMCUStateMachine();

    /*Start the driver                                                       */
    lRetVal = Network_IF_InitDriver(ROLE_STA);
    if (lRetVal < 0) {
        UART_PRINT("Failed to start SimpleLink Device\r\n", lRetVal);
        return (-1);
    }

    /*switch on Board_GPIO_LED2 to indicate Simplelink is properly up.       */

    /*Start Timer to blink Board_GPIO_LED0 till AP connection                */
    LedTimerConfigNStart();

    /*Initialize AP security params                                          */
    SecurityParams.Key = (signed char *)SECURITY_KEY;
    SecurityParams.KeyLen = strlen(SECURITY_KEY);
    SecurityParams.Type = SECURITY_TYPE;

    /*Connect to the Access Point                                            */
    lRetVal = Network_IF_ConnectAP(SSID_Remote_Name, SecurityParams);
    if (lRetVal < 0) {
        UART_PRINT("Connection to an AP failed\r\n");
        return (-1);
    }
    //        sleep(10);
    httpsTask(&addr);
    //    UART_PRINT("SlNetUtil_inetPton addr %x\r\n",((SlNetSock_InAddr_t *)&addr)->s_addr);

    /*Disable the LED blinking Timer as Device is connected to AP.           */
    LedTimerDeinitStop();

    /*Switch ON Board_GPIO_LED0 to indicate that Device acquired an IP.      */
    GPIO_write(Board_GPIO_LED0, Board_GPIO_LED_ON);

    sleep(5);

    GPIO_write(Board_GPIO_LED0, Board_GPIO_LED_OFF);
    GPIO_write(Board_GPIO_LED1, Board_GPIO_LED_OFF);

    return (0);
}

//*****************************************************************************
//!
//! MQTT Start - Initialize and create all the items required to run the MQTT
//! protocol
//!
//! \param  none
//!
//! \return None
//!
//*****************************************************************************
void Mqtt_start() {
    int32_t threadArg = 100;
    pthread_attr_t pAttrs;
    struct sched_param priParam;
    int32_t retc = 0;
    mq_attr attr;
    unsigned mode = 0;

    /*sync object for inter thread communication                             */
    attr.mq_maxmsg = 100;
    attr.mq_curmsgs = 0;
    attr.mq_msgsize = sizeof(struct msgQueue);
    g_PBQueue = mq_open("g_PBQueue", O_CREAT, mode, &attr);

    if (g_PBQueue == NULL) {
        UART_PRINT("MQTT Message Queue create fail\r\n");
        gInitState &= ~MQTT_INIT_STATE;
        return;
    }

    /*Set priority and stack size attributes                                 */
    pthread_attr_init(&pAttrs);
    /**
     * The higher the number, the higher the priority.
     * The priority of the MqttClient thread and the Bluetooth thread here cannot be lower than the others,
     * otherwise it may not run properly.
     * */
    priParam.sched_priority = 3;
    retc = pthread_attr_setschedparam(&pAttrs, &priParam);
    retc |= pthread_attr_setstacksize(&pAttrs, MQTTTHREADSIZE);
    retc |= pthread_attr_setdetachstate(&pAttrs, PTHREAD_CREATE_DETACHED);

    if (retc != 0) {
        gInitState &= ~MQTT_INIT_STATE;
        UART_PRINT("MQTT thread create fail\r\n");
        return;
    }

    retc = pthread_create(&mqttThread, &pAttrs, MqttClient, (void *)&addr);
    if (retc != 0) {
        gInitState &= ~MQTT_INIT_STATE;
        UART_PRINT("MQTT thread create fail\r\n");
        return;
    }

    gInitState &= ~MQTT_INIT_STATE;
}

//*****************************************************************************
//!
//! MQTT Stop - Close the client instance and free all the items required to
//! run the MQTT protocol
//!
//! \param  none
//!
//! \return None
//!
//*****************************************************************************

void Mqtt_Stop() {
    struct msgQueue queueElement;
    struct msgQueue queueElemRecv;

    if (gApConnectionState >= 0) {
        Mqtt_ClientStop(1);
    }

    queueElement.event = THREAD_TERMINATE_REQ;
    queueElement.msgPtr = NULL;

    /*write message indicating publish message                               */
    if (MQTT_SendMsgToQueue(&queueElement)) {
        UART_PRINT(
            "Queue is full, throw first msg and send the new one\r\n");
        mq_receive(g_PBQueue, (char *)&queueElemRecv, sizeof(struct msgQueue),
                   NULL);
        MQTT_SendMsgToQueue(&queueElement);
    }

    sleep(2);

    mq_close(g_PBQueue);
    g_PBQueue = NULL;

    sl_Stop(SL_STOP_TIMEOUT);
    UART_PRINT("Client Stop completed\r\n");

    /*Disable the SW2 and SW3 interrupt */
    //    GPIO_disableInt(Board_GPIO_BUTTON0); // SW2
    //    GPIO_disableInt(Board_GPIO_BUTTON1); // SW3
}

//*****************************************************************************
//
//! \brief Open a TCP socket and modify its properties i.e security options if req.
//! Socket properties modified in this function are based on the options set
//! outside the scope of this function.
//! Returns a valid handle on success, otherwise a negative number.
//! Mqtt_createSocket is the createSocket source code from the official MQTT library. It is rewritten here to support IPv6.
//*****************************************************************************
static int32_t Mqtt_createSocket(uint32_t nwconnOpts,
                                 MQTT_SecureConn_t *nwSecurityOpts,
                                 const char *serverAddr,
                                 bool isServer) {
    int32_t socketFd;
    int32_t status;
    uint32_t dummyVal = 1;
    SlNetSockSecAttrib_t *secAttrib;
    SlNetSockSecAttrib_e attribName;
    // local variables for creating secure socket
    uint8_t SecurityMethod;
    uint32_t SecurityCypher;

    int8_t i;

