yjdwbj/msp432_cmake_clang/app/common/mqtt_client_app.c
    /* If TLS is required, The TLS secure connection here requires independent TLS protocol stack support. */
    if ((nwconnOpts & MQTT_DEV_NETCONN_OPT_SEC) != 0) {
        /* Create security attribute */
        secAttrib = SlNetSock_secAttribCreate();

        /* Check if the function failed */
        if (NULL == secAttrib) {
            return (MQTT_PACKET_ERR_ALLOC_FAILED);
        }

        socketFd =
            SlNetSock_create(SLNETSOCK_AF_INET, SLNETSOCK_SOCK_STREAM,
                             SLNETSOCK_PROTO_TCP,
                             0,
                             0);
        if (socketFd < 0) {
            SlNetSock_secAttribDelete(secAttrib);
            return (socketFd);
        }

        SecurityMethod = *((uint8_t *)(nwSecurityOpts->method));
        SecurityCypher = *((uint32_t *)(nwSecurityOpts->cipher));

        /* Domain name verification only works with URL address
           Check if Skip domain name verification is disabled
           and if the address input is url address.             */
        if (((nwconnOpts &
              MQTT_DEV_NETCONN_OPT_SKIP_DOMAIN_NAME_VERIFICATION) == 0) &&
            ((nwconnOpts & MQTT_DEV_NETCONN_OPT_URL) != 0)) {
            status =
                SlNetSock_secAttribSet(secAttrib,
                                       SLNETSOCK_SEC_ATTRIB_DOMAIN_NAME,
                                       (void *)serverAddr, strlen(serverAddr));
            if (status < 0) {
                SlNetSock_secAttribDelete(secAttrib);
                SlNetSock_close(socketFd);
                return (status);
            }
        }

        /* Check if Skip certificate catalog verification is
           enabled.                                             */
        if ((nwconnOpts &
             MQTT_DEV_NETCONN_OPT_SKIP_CERTIFICATE_CATALOG_VERIFICATION) != 0) {
            status = SlNetSock_secAttribSet(
                secAttrib, SLNETSOCK_SEC_ATTRIB_DISABLE_CERT_STORE,
                (void *)&dummyVal, sizeof(dummyVal));
            if (status < 0) {
                SlNetSock_secAttribDelete(secAttrib);
                SlNetSock_close(socketFd);
                return (status);
            }
        }

        if (nwSecurityOpts->nFile < 1 || nwSecurityOpts->nFile > 4) {
            SlNetSock_secAttribDelete(secAttrib);
            SlNetSock_close(socketFd);
            /* security files missing or wrong number of security files
               Did not create socket */
            return (MQTT_PACKET_ERR_FNPARAM);
        }

        // Set Socket Options that were just defined
        status =
            SlNetSock_secAttribSet(secAttrib, SLNETSOCK_SEC_ATTRIB_METHOD,
                                   (void *)&(SecurityMethod),
                                   sizeof(SecurityMethod));
        if (status < 0) {
            SlNetSock_secAttribDelete(secAttrib);
            SlNetSock_close(socketFd);
            return (status);
        }

        status =
            SlNetSock_secAttribSet(secAttrib, SLNETSOCK_SEC_ATTRIB_CIPHERS,
                                   (void *)&(SecurityCypher),
                                   sizeof(SecurityCypher));
        if (status < 0) {
            SlNetSock_secAttribDelete(secAttrib);
            SlNetSock_close(socketFd);
            return (status);
        }

        if (nwSecurityOpts->nFile == 1) {
            status =
                SlNetSock_secAttribSet(secAttrib,
                                       SLNETSOCK_SEC_ATTRIB_PEER_ROOT_CA,
                                       (void *)nwSecurityOpts->files[0],
                                       strlen(
                                           nwSecurityOpts->files[0]));
            if (status < 0) {
                SlNetSock_secAttribDelete(secAttrib);
                SlNetSock_close(socketFd);
                return (status);
            }
        } else {
            for (i = 0; i < nwSecurityOpts->nFile; i++) {
                if (NULL != nwSecurityOpts->files[i]) {
                    attribName =
                        (SlNetSockSecAttrib_e)(SLNETSOCK_SEC_ATTRIB_PRIVATE_KEY + i);
                    status = SlNetSock_secAttribSet(
                        secAttrib, attribName,
                        (void *)nwSecurityOpts->files[i], strlen(nwSecurityOpts->files[i]));
                    if (status < 0) {
                        SlNetSock_secAttribDelete(secAttrib);
                        SlNetSock_close(socketFd);
                        return (status);
                    }
                }
            }
        }
        status = SlNetSock_startSec(socketFd, secAttrib, isServer ? (SLNETSOCK_SEC_BIND_CONTEXT_ONLY | SLNETSOCK_SEC_IS_SERVER) : SLNETSOCK_SEC_BIND_CONTEXT_ONLY);
        if (status < 0) {
            SlNetSock_secAttribDelete(secAttrib);
            SlNetSock_close(socketFd);
            return (status);
        }
        SlNetSock_secAttribDelete(secAttrib);
    }
    // If no TLS required
    else {
        // check to create a udp or tcp socket
        if ((nwconnOpts & MQTT_DEV_NETCONN_OPT_UDP) != 0) {
            socketFd =
                SlNetSock_create(SLNETSOCK_AF_INET, SLNETSOCK_SOCK_DGRAM,
                                 SLNETSOCK_PROTO_UDP,
                                 0,
                                 0);
        } else if ((nwconnOpts & MQTT_DEV_NETCONN_OPT_IP6) != 0) {
            socketFd =
                SlNetSock_create(SLNETSOCK_AF_INET6, SLNETSOCK_SOCK_STREAM,
                                 SLNETSOCK_PROTO_TCP, 0,
                                 0); // consider putting 0 in place of SLNETSOCK_PROTO_TCP
        } else                       // socket for tcp
        {
            socketFd =
                SlNetSock_create(SLNETSOCK_AF_INET, SLNETSOCK_SOCK_STREAM,
                                 SLNETSOCK_PROTO_TCP, 0,
                                 0); // consider putting 0 in place of SLNETSOCK_PROTO_TCP
        }
    }

    return (socketFd);
}

/*
 *  ======== getAddrByName ========
 *  Retrieve host IP address corresponding to a host name
 *  Came from ti/net/sntp/sntp.c
 */
static int32_t getAddrByName(const char *name,
                             uint32_t *addr,
                             uint16_t *family) {

    int32_t ifID;
    int32_t i;
    uint16_t addrLen = SLNETUTIL_DNSBUFSIZE / sizeof(uint32_t);
    SlNetSock_AddrIn6_t *sin6 = addr;

    /* Query DNS for IPv4 address. */
    ifID = SlNetUtil_getHostByName(0, (char *)name, strlen(name), addr, &addrLen, SLNETSOCK_AF_INET);
    if (ifID < 0) {
        addrLen = SLNETUTIL_DNSBUFSIZE / sizeof(SlNetSock_In6Addr_t);

        ifID = SlNetUtil_getHostByName(0, (char *)name, strlen(name), addr, &addrLen, SLNETSOCK_AF_INET6);
        //        ifID = sl_NetAppDnsGetHostByName((char *)name, strlen(name), addr, SL_AF_INET6);

