yjdwbj/msp432_cmake_clang/app/common/mqtt_client_app.c
        if (ifID < 0) {
            /* return an error */
            UART_PRINT("sl_NetAppDnsGetHostByName error %d\r\n", ifID);
            return (-1);
        }
        *family = SLNETSOCK_AF_INET6;
    } else {
        *family = SLNETSOCK_AF_INET;
    }

    /* Return the interface ID */
    return (ifID);
}


#ifdef _USE_IPV6
//*****************************************************************************
//
//! \brief  Open a TCP socket with required properties
//! Also connect to the server.
//! Returns a valid handle on success, NULL on failure.
//! MQTTNet46_commOpen is MQTTNet_commOpen from the source code ti/net/mqtt/platform/mqtt_net_func.c in the official MQTT library.
//! It is rewritten here to support IPv6.
//! The current version of SINetIfWiFi network stack does not support IPv6. Only SINetIfNDK (Ethernet) supports IPv6
//
//*****************************************************************************
static int32_t MQTTNet46_commOpen(uint32_t nwconnOpts,
                                  const char *serverStr,
                                  uint16_t portNumber,
                                  const MQTT_SecureConn_t *nwSecurity) {
    int32_t socketFd, status, ifID;
    SlNetSock_AddrIn6_t serverAddr;
    int32_t srvAddrSize;
    uint32_t uiIP[4];
    uint16_t family;
    uint32_t nOpts = nwconnOpts;

    // Code reference SDK ti/net/sntp/sntp.c
    if ((nwconnOpts & MQTT_DEV_NETCONN_OPT_URL) != 0) {
        memset(&uiIP, 0, sizeof(uiIP));
        ifID = getAddrByName(serverStr, uiIP, &family);
    }

    // create socket
    socketFd =
        Mqtt_createSocket(family == SLNETSOCK_AF_INET6 ? nOpts | MQTT_DEV_NETCONN_OPT_IP6 : nOpts,
                          (MQTT_SecureConn_t *)nwSecurity, serverStr,
                          false);
    if (socketFd < 0) {
        /* ERROR: Could not create a socket */
        UART_PRINT("RROR: Could not create a socket failed\r\n");
        return (socketFd);
    }

    if ((nwconnOpts & MQTT_DEV_NETCONN_OPT_UDP) != 0) {
        // filling the UDP server socket address
        ((SlNetSock_AddrIn_t *)&serverAddr)->sin_addr.s_addr = 0;

        status = SlNetSock_bind(socketFd, (SlNetSock_Addr_t *)&serverAddr,
                                srvAddrSize);
        if (status < 0) {
            // error
            SlNetSock_close(socketFd);
            return (status);
        }
    } else {

        // do tcp connect map SlNetIfWifi_connect --> sl_Connect
        /* By carefully looking at the SDK documentation, the calling relationship is SlNetSock_connect --> SlNetIfWifi_connect --> sl_Connect. */

        serverAddr.sin6_family = family;
        serverAddr.sin6_port = SlNetUtil_htons(portNumber);
        srvAddrSize = sizeof(SlNetSock_AddrIn6_t);

        //        SlNetUtil_inetPton(SLNETSOCK_AF_INET6, serverStr, uiIP);
        serverAddr.sin6_addr._S6_un._S6_u32[0] = SlNetUtil_htonl(uiIP[0]);
        serverAddr.sin6_addr._S6_un._S6_u32[1] = SlNetUtil_htonl(uiIP[1]);
        serverAddr.sin6_addr._S6_un._S6_u32[2] = SlNetUtil_htonl(uiIP[2]);
        serverAddr.sin6_addr._S6_un._S6_u32[3] = SlNetUtil_htonl(uiIP[3]);
        UART_PRINT("Ipv6 Server Address : %4x:%4x:%4x:%4x:%4x:%4x:%4x:%4x\r\n",
                   serverAddr.sin6_addr._S6_un._S6_u16[0],
                   serverAddr.sin6_addr._S6_un._S6_u16[1],
                   serverAddr.sin6_addr._S6_un._S6_u16[2],
                   serverAddr.sin6_addr._S6_un._S6_u16[3],
                   serverAddr.sin6_addr._S6_un._S6_u16[4],
                   serverAddr.sin6_addr._S6_un._S6_u16[5],
                   serverAddr.sin6_addr._S6_un._S6_u16[6],
                   serverAddr.sin6_addr._S6_un._S6_u16[7]);
        status = SlNetSock_connect(socketFd, (SlNetSock_Addr_t *)&serverAddr,
                                   srvAddrSize);

        if (status < 0) {
            /* ERROR: SlNetSock_connect failed */

            if ((SLNETERR_ESEC_SNO_VERIFY != status) ||
                ((SLNETERR_ESEC_DATE_ERROR != status) &&
                 (nwconnOpts & MQTT_DEV_NETCONN_OPT_SKIP_DATE_VERIFICATION))) {
                UART_PRINT("Ipv6 Server ERROR: Could not establish connection to server, Closing the socket\r\n");
                /* ERROR: Could not establish connection to server, Closing the socket */
                SlNetSock_close(socketFd);
                return (status);
            }

            if (status == SLNETERR_BSD_ECONNREFUSED) {
                /* Note: Check whether the server can be connected by other clients. Is it started? Is there a defense wall in the middle? */
            }
            // else - SLNETERR_ESEC_SNO_VERIFY == status or SLNETERR_ESEC_DATE_ERROR == status
            /* ERROR: Could not establish secure connection to server,
               Continuing with unsecured connection to server */
        }

        if ((nwconnOpts & MQTT_DEV_NETCONN_OPT_SEC) != 0) {
            status = SlNetSock_startSec(
                socketFd, NULL, SLNETSOCK_SEC_START_SECURITY_SESSION_ONLY);
            if (status < 0) {
                SlNetSock_close(socketFd);
                return (status);
            }
        }

        // Success - Connected to server
    } // end of doing binding port to udp socket or doing tcp connect

    return (socketFd);
}
#endif

int32_t MqttClient_start() {
    int32_t lRetVal = -1;
    int32_t iCount = 0;

    int32_t threadArg = 100;
    pthread_attr_t pAttrs;
    struct sched_param priParam;

    MqttClientExmple_params.clientId = ClientId;
    MqttClientExmple_params.connParams = &Mqtt_ClientCtx;
    MqttClientExmple_params.mqttMode31 = MQTT_3_1;
    MqttClientExmple_params.blockingSend = true;

    gInitState |= CLIENT_INIT_STATE;
#ifdef _USE_IPV6
    UART_PRINT("Use IPv6 stack.\r\n");
    MQTTClient_net.open = MQTTNet46_commOpen;
#endif
    /*Initialize MQTT client lib                                             */
    gMqttClient = MQTTClient_create(MqttClientCallback,
                                    &MqttClientExmple_params);

